app/controllers/homepage_controller.rb

SELECT "tenants".* FROM "tenants"
---
  def index
	@tenants = Tenant.all.sort { |t1, t2| t1.id <=> t2.id }