app/controllers/vendor_controller.rb

  	def index
  		@vendor = Vendor.all.sort { |t1, t2| t1.id <=> t2.id }
---
SELECT "vendors".* FROM "vendors"

  	def search
  		@vendor = Vendor.all.sort { |t1, t2| t1.id <=> t2.id }
---
SELECT "vendors".* FROM "vendors"